:PROPERTIES:
:ID:       2221435b-d65e-46a7-b896-ec1e1c07ddd4
:END:
#+TITLE: linux init  configuration
#+AUTHOR: rileyrg
#+EMAIL: rileyrg at g m x dot de

#+LANGUAGE: en
#+STARTUP: showall

#+EXPORT_FILE_NAME: README.md
#+OPTIONS: toc:nil

#+OPTIONS: ^:nil
#+EXCLUDE_TAGS: tasklist noexport
# do not export any sections marked as tasks unless TODO or DONE
#+OPTIONS: tasks:("TODO" "DONE")

#+PROPERTY: header-args:bash :tangle-mode (identity #o555)
####+PROPERTY: header-args:python :tangle-mode (identity #o555)
#+PROPERTY: header-args:conf :tangle-mode (identity #o444)
#+PROPERTY: header-args:gpg :cache no :tangle-mode (identity #o600)
#+PROPERTY: export:md yes

#+FILETAGS: :linux:

**** xrandr-dpi-calc
org code block to calculate the DPI - pass inWidth as width in inches, else cmWidth as.... yay!
#+name: xrandr-dpi-calc
#+begin_src emacs-lisp :var xRes=1920 inWidth=0 cmWidth=28
  (let*((inWidth (or (if (eq inWidth 0)(/ cmWidth 2.54) inWidth )))
        (dpi (/ xRes inWidth)))
    (setq rgr/monitor-DPI dpi)
    (format "DPI of %.1f inch width screen with a horizontal pixel count of %d is: %d"
            inWidth xRes dpi))
#+end_src

#+RESULTS: xrandr-dpi-calc
: DPI of 11.0 inch width screen with a horizontal pixel count of 1920 is: 174

*** cur ws
#+name: cur_ws_json
#+begin_src bash :results output drawer
  swaymsg -t get_workspaces | jq '.[] | select (.focused)'
#+end_src

#+RESULTS: cur_ws_json
:results:
{
"id": 20,
"name": "1:edit",
"rect": {
"x": 4,
"y": 4,
"width": 1912,
"height": 1042
},
"focus": [
14,
21,
11
],
"border": "none",
"current_border_width": 0,
"layout": "splith",
"orientation": "horizontal",
"percent": null,
"window_rect": {
"x": 0,
"y": 0,
"width": 0,
"height": 0
},
"deco_rect": {
"x": 0,
"y": 0,
"width": 0,
"height": 0
},
"geometry": {
"x": 0,
"y": 0,
"width": 0,
"height": 0
},
"window": null,
"urgent": false,
"marks": [],
"fullscreen_mode": 1,
"nodes": [],
"floating_nodes": [
{
"id": 11,
"name": "ScratchTerminal",
"rect": {
"x": 480,
"y": 146,
"width": 960,
"height": 783
},
"focused": false,
"focus": [],
"border": "normal",
"current_border_width": 2,
"layout": "none",
"orientation": "none",
"percent": 0.38982002746568795,
"window_rect": {
"x": 2,
"y": 0,
"width": 956,
"height": 781
},
"deco_rect": {
"x": 476,
"y": 116,
"width": 960,
"height": 26
},
"geometry": {
"x": 0,
"y": 0,
"width": 800,
"height": 600
},
"window": null,
"urgent": false,
"marks": [
"α"
],
"fullscreen_mode": 0,
"nodes": [],
"floating_nodes": [],
"sticky": false,
"type": "floating_con",
"pid": 227866,
"app_id": "Alacritty",
"visible": true,
"max_render_time": 0,
"shell": "xdg_shell",
"inhibit_idle": false,
"idle_inhibitors": {
"user": "none",
"application": "none"
}
}
],
"sticky": false,
"num": 1,
"output": "eDP-1",
"type": "workspace",
"representation": "H[Emacs Alacritty]",
"focused": true,
"visible": true
}
:end:
{
"id": 23,
"name": "1:edit",
"rect": {
"x": 4,
"y": 4,
"width": 1912,
"height": 1042
},
"focus": [
26
],
"border": "none",
"current_border_width": 0,
"layout": "tabbed",
"orientation": "none",
"percent": null,
"window_rect": {
"x": 0,
"y": 0,
"width": 0,
"height": 0
},
"deco_rect": {
"x": 0,
"y": 0,
"width": 0,
"height": 0
},
"geometry": {
"x": 0,
"y": 0,
"width": 0,
"height": 0
},
"window": null,
"urgent": false,
"marks": [],
"fullscreen_mode": 1,
"nodes": [],
"floating_nodes": [],
"sticky": false,
"num": 1,
"output": "eDP-1",
"type": "workspace",
"representation": "T[Emacs]",
"focused": true,
"visible": true
}
*** cur ws id
#+name: cur_ws_id
#+begin_src bash :var json=cur_ws_json
  echo $json | jq '.id'
#+end_src

#+RESULTS: cur_ws_id
: 20
*** cur ws nodes
#+name: cur_ws_nodes
#+begin_src bash :var id=cur_ws_id :results output drawer
  swaymsg -t get_tree | jq '.nodes[1] | .nodes[] | select(.id==23).nodes'
#+end_src

#+RESULTS: cur_ws_nodes
:results:
:end:

